{
  "model_name": "TFT",
  "architecture": {
    "input_shape": [
      null,
      30,
      6
    ],
    "output_shape": [
      null,
      1
    ],
    "total_params": 53803,
    "sequence_length": 30,
    "num_features": 6
  },
  "layers": [
    {
      "index": 2,
      "name": "variable_selection",
      "type": "Dense",
      "config": {
        "name": "variable_selection",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 6,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "weights": [
        [
          0.5688906908035278,
          -0.6767840385437012,
          0.5205630660057068,
          -0.3889525234699249,
          0.11883433908224106,
          0.3446443974971771,
          0.19321474432945251,
          0.57184898853302,
          -0.6476054191589355,
          -0.3092120587825775,
          0.31164756417274475,
          0.7131803631782532,
          0.016276897862553596,
          -0.11961722373962402,
          -0.02274302951991558,
          0.24438270926475525,
          0.5472332239151001,
          0.010398700833320618,
          0.6985633969306946,
          0.4713491201400757,
          -0.22791607677936554,
          -0.595212459564209,
          0.5497648119926453,
          0.22709116339683533,
          -0.7103451490402222,
          0.5337551236152649,
          -0.6692797541618347,
          0.2556357979774475,
          0.5708500742912292,
          0.44288894534111023,
          0.1690332591533661,
          0.3867748975753784,
          0.41154685616493225,
          -0.48873370885849,
          0.30445387959480286,
          -0.5668865442276001
        ],
        [
          -0.0071821617893874645,
          0.0033593280240893364,
          -0.0059153917245566845,
          -0.002170190215110779,
          0.013398798182606697,
          0.006316404789686203
        ]
      ],
      "weight_shapes": [
        [
          6,
          6
        ],
        [
          6
        ]
      ]
    },
    {
      "index": 5,
      "name": "temporal_lstm",
      "type": "LSTM",
      "config": {
        "name": "temporal_lstm",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "return_sequences": true,
        "return_state": false,
        "go_backwards": false,
        "stateful": false,
        "unroll": false,
        "zero_output_for_mask": false,
        "units": 64,
        "activation": "tanh",
        "recurrent_activation": "sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "recurrent_initializer": {
          "module": "keras.initializers",
          "class_name": "Orthogonal",
          "config": {
            "seed": null,
            "gain": 1.0
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "unit_forget_bias": true,
        "kernel_regularizer": null,
        "recurrent_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "recurrent_constraint": null,
        "bias_constraint": null,
        "dropout": 0.2,
        "recurrent_dropout": 0.2,
        "seed": null
      },
      "weights": [
        [
          -0.07192201167345047,
          -0.04497605562210083,
          -0.12798021733760834,
          -0.03580455854535103,
          -0.13264094293117523,
          0.13867652416229248,
          -0.0332738496363163,
          -0.13525933027267456,
          0.08679889887571335,
          0.13246922194957733,
          -0.023208728060126305,
          0.04215705022215843,
          -0.019272666424512863,
          -0.031491994857788086,
          0.07816950976848602,
          -0.1413472443819046,
          -0.12193503975868225,
          0.047520630061626434,
          0.12259072810411453,
          0.1249639019370079,
          -0.10242883116006851,
          -0.0400664284825325,
          -0.07853715866804123,
          0.027124589309096336,
          -0.13357484340667725,
          -0.04899057373404503,
          -0.0012675871839746833,
          -0.15709273517131805,
          -0.102195605635643,
          -0.07538393884897232,
          0.029095487669110298,
          -0.07080350071191788,
          0.08650089055299759,
          -0.006089318543672562,
          0.008360334672033787,
          0.08224818110466003,
          0.03442694991827011,
          0.039791230112314224,
          -0.01243641134351492,
          0.15007972717285156,
          -0.11668117344379425,
          0.010310170240700245,
          0.0885813981294632,
          0.014088771305978298,
          -0.13596464693546295,
          0.04550671577453613,
          0.09839605540037155,
          0.028289442881941795,
          0.10826762765645981,
          -0.04407477378845215,
          -0.10423662513494492,
          0.0044276476837694645,
          -0.03846288472414017,
          0.02268998511135578,
          -0.008808132261037827,
          0.009622091427445412,
          -0.147910013794899,
          0.08828901499509811,
          -0.004422730300575495,
          -0.04502550885081291,
          0.018366141244769096,
          0.12219224870204926,
          0.14330430328845978,
          -0.03194832056760788,
          0.025390874594449997,
          0.1143682599067688,
          -0.031239833682775497,
          0.07500983029603958,
          -0.0038007921539247036,
          -0.030993491411209106,
          0.06586041301488876,
          0.07758220285177231,
          -0.04484695568680763,
          0.020749280229210854,
          -0.02993975766003132,
          -0.0037341956049203873,
          -0.07729505002498627,
          0.0684410035610199,
          -0.10370510071516037,
          0.10568022727966309,
          0.013402868993580341,
          0.02181895077228546,
          0.0034381309524178505,
          -0.033714279532432556,
          -0.08720392733812332,
          -0.08690904080867767,
          0.11524902284145355,
          -0.1366826891899109,
          -0.0449926033616066,
          0.12449098378419876,
          -0.06778372079133987,
          0.05801963433623314,
          -0.02304295264184475,
          0.04422500357031822,
          -0.07096333801746368,
          0.13612140715122223,
          0.15630263090133667,
          0.08805226534605026,
          -0.020733121782541275,
          0.10836368054151535,
          0.08142028003931046,
          -0.051856234669685364,
          -0.02509975992143154,
          -0.07305842638015747,
          -0.043172113597393036,
          0.0004828631062991917,
          0.12614059448242188,
          -0.11013451963663101,
          0.06456784904003143,
          0.14831678569316864,
          -0.12261425703763962,
          0.1290612369775772,
          -0.04641321301460266,
          0.10292869061231613,
          0.1382986456155777,
          0.08065100014209747,
          0.11344292014837265,
          0.1190897598862648,
          0.12178455293178558,
          -0.04992646351456642,
          0.11235653609037399,
          -0.08011142164468765,
          0.05999037250876427,
          -0.07078055292367935,
          -0.010512497276067734,
          0.05314693599939346,
          0.09629666060209274,
          -0.008745669387280941,
          -0.07037951797246933,
          -0.13581058382987976,
          0.11113840341567993,
          -0.11686435341835022,
          0.018912389874458313,
          0.02583237551152706,
          0.08314307779073715,
          0.04694255441427231,
          0.06323251128196716,
          -0.013607896864414215,
          -0.15703490376472473,
          0.03756825253367424,
          0.12324713170528412,
          0.040496405214071274,
          0.05732438340783119,
          0.03095899149775505,
          0.007238599471747875,
          -0.12399521470069885,
          0.08606310188770294,
          -0.07818346470594406,
          -0.07421565800905228,
          0.049916792660951614,
          0.03970501944422722,
          -0.07978808134794235,
          0.06029834225773811,
          -0.016881654039025307,
          -0.14004993438720703,
          -0.11573510617017746,
          -0.025582578033208847,
          0.11277858912944794,
          0.13039857149124146,
          0.12127912044525146,
          -0.03776944801211357,
          -0.07960765808820724,
          0.12634441256523132,
          0.13882781565189362,
          -0.03556382283568382,
          0.018457723781466484,
          0.130080446600914,
          -0.11444665491580963,
          0.09847061336040497,
          0.06546539813280106,
          -0.002238665008917451,
          0.07825294882059097,
          -0.12032469362020493,
          0.13020312786102295,
          -0.09870435297489166,
          -0.10647351294755936,
          0.027516944333910942,
          -0.008337858133018017,
          -0.10390959680080414,
          -0.001026528887450695,
          0.10772713273763657,
          -0.08948317915201187,
          0.04868890717625618,
          0.027287010103464127,
          0.02655073069036007,
          -0.07154931128025055,
          0.015137048438191414,
          0.11604813486337662,
          -0.020904870703816414,
          0.00610471423715353,
          0.10337651520967484,
          -0.005121532827615738,
          0.047924190759658813,
          0.016511892899870872,
          -0.10677184164524078,
          -0.047094494104385376,
          0.10183937847614288,
          0.13130316138267517,
          -0.02902703545987606,
          0.04569559544324875,
          -0.15295256674289703,
          0.06563636660575867,
          -0.09150116890668869,
          0.016697997227311134,
          0.029458601027727127,
          0.04512131214141846,
          0.1309501826763153,
          0.11120209097862244,
          0.005020573735237122,
          0.12628132104873657,
          0.14881566166877747,
          0.0013092702720314264,
          0.12130780518054962,
          -0.033755112439394,
          -0.08674021810293198,
          0.044276680797338486,
          -0.01780594512820244,
          -0.12238577753305435,
          -0.007829030975699425,
          0.056679967790842056,
          -0.10630696266889572,
          -0.10765420645475388,
          0.05047324299812317,
          -0.10368615388870239,
          0.01093248836696148,
          0.08134637027978897,
          0.08435512334108353,
          0.14210177958011627,
          -0.09668632596731186,
          0.13106901943683624,
          -0.06861390918493271,
          0.13544367253780365,
          0.10443861037492752,
          0.04244600981473923,
          0.01039014384150505,
          0.10812637209892273,
          0.10796616226434708,
          -0.0760662704706192,
          0.009081960655748844,
          -0.07666444778442383,
          0.0485822819173336,
          -0.0651065930724144,
          0.07857683300971985,
          0.12070409953594208,
          -0.09043648093938828,
          0.14479519426822662,
          0.15195506811141968,
          0.06673329323530197,
          0.005303708370774984,
          0.059183426201343536,
          0.08309061080217361,
          -0.10142839699983597,
          0.11464156955480576,
          0.1409527212381363,
          -0.1343812644481659,
          -0.10914134234189987,
          -0.1521947681903839,
          -0.15349574387073517,
          -0.029300430789589882,
          0.08381623774766922,
          -0.054638538509607315,
          0.07976483553647995,
          -0.0232855211943388,
          -0.11903142929077148,
          0.10890479385852814,
          -0.05708196759223938,
          0.14389723539352417,
          -0.09019768238067627,
          -0.0253510233014822,
          0.10460791736841202,
          -0.040783364325761795,
          0.10008364915847778,
          -0.05550624057650566,
          0.1460089087486267,
          -0.10533919185400009,
          -0.10697513818740845,
          -0.06988004595041275,
          0.10419254004955292,
          0.037833321839571,
          0.0730101466178894,
          0.030924437567591667,
          0.1268869787454605,
          -0.10652774572372437,
          0.002256999723613262,
          0.055357202887535095,
          0.09529902786016464,
          -0.058232758194208145,
          0.12921586632728577,
          0.10531384497880936,
          0.10908149927854538,
          0.0575316846370697,
          0.10013500601053238,
          0.08112818002700806,
          -0.0249528456479311,
          0.01842602714896202,
          0.02656206488609314,
          0.1255708932876587,
          0.10444173961877823,
          -0.09409970045089722,
          -0.10205309838056564,
          -0.06391735374927521,
          0.14233623445034027,
          0.12792177498340607,
          0.10967124998569489,
          -0.045678120106458664,
          0.15563058853149414,
          0.048077069222927094,
          0.11576516926288605,
          0.040679484605789185,
          -0.12363806366920471,
          0.13245715200901031,
          0.023622596636414528,
          0.12736912071704865,
          -0.055434033274650574,
          -0.05761221423745155,
          -0.10921879857778549,
          -0.06193789467215538,
          0.12043201923370361,
          -0.05679120495915413,
          -0.11428011208772659,
          0.027551086619496346,
          0.00040173143497668207,
          0.09974842518568039,
          0.10171345621347427,
          0.09817620366811752,
          -0.08118315041065216,
          0.10147421807050705,
          0.06083042174577713,
          0.062491871416568756,
          0.07331007719039917,
          -0.011835685931146145,
          0.09951790422201157,
          -0.054661817848682404,
          0.02030392736196518,
          -0.12790657579898834,
          -0.11675664782524109,
          -0.09249939024448395,
          -0.08872572332620621,
          0.11939020454883575,
          -0.001517917262390256,
          -0.018798381090164185,
          0.02949400618672371,
          0.05934537574648857,
          -0.14318881928920746,
          -0.030406557023525238,
          0.08173703402280807,
          -0.10507012158632278,
          -0.11864935606718063,
          0.00040543332579545677,
          0.08115110546350479,
          -0.05346336588263512,
          0.1415921449661255,
          -0.09455940127372742,
          0.10871027410030365,
          -0.07738916575908661,
          -0.08300706744194031,
          -0.14817805588245392,
          0.026601102203130722,
          0.002681053476408124,
          0.04590209573507309,
          -0.08690066635608673,
          -0.09242458641529083,
          0.14032717049121857,
          -0.07294981926679611,
          0.021175295114517212,
          -0.1035136952996254,
          0.037851665169000626,
          -0.08526622503995895,
          0.11273723095655441,
          0.01758493296802044,
          0.027167193591594696,
          -0.08560798317193985,
          -0.10697978734970093,
          -0.13397198915481567,
          -0.08486493676900864,
          0.021532054990530014,
          0.05060744658112526,
          -0.12503710389137268,
          -0.10582030564546585,
          -0.0003539934696163982,
          0.04089340195059776,
          0.007126253098249435,
          0.06960196048021317,
          -0.05306820571422577,
          0.04147721827030182,
          -0.04747137799859047,
          0.07979036122560501,
          0.05411677435040474,
          -0.059273701161146164,
          0.13462214171886444,
          0.11845562607049942,
          -0.024319294840097427,
          0.11243433505296707,
          -0.04276462644338608,
          -0.10973155498504639,
          -0.05912910774350166,
          -0.13062624633312225,
          0.130136638879776,
          0.06311456114053726,
          0.07118836790323257,
          -0.14191994071006775,
          -0.12077347934246063,
          -0.11733420938253403,
          -0.013020549900829792,
          -0.13485844433307648,
          -0.10100848227739334,
          -0.07273475080728531,
          0.024959826841950417,
          0.1334647834300995,
          0.12199211120605469,
          -0.01981445774435997,
          0.0332629419863224,
          0.09003931283950806,
          0.10368624329566956,
          0.06291714310646057,
          -0.0931682363152504,
          0.02252117171883583,
          -0.073770672082901,
          -0.15237286686897278,
          0.06825241446495056,
          -0.03300740197300911,
          -0.0018714995821937919,
          0.15206278860569,
          0.03859574347734451,
          -0.08992242813110352,
          -0.08750450611114502,
          -0.14353622496128082,
          0.07280023396015167,
          -0.04659464582800865,
          -0.14950434863567352,
          0.0896572396159172,
          0.12361306697130203,
          0.020529871806502342,
          -0.1348544806241989,
          0.0035657493863254786,
          0.13578753173351288,
          -0.10463721305131912,
          -0.06676150113344193,
          -0.14410294592380524,
          -0.09506218880414963,
          -0.07379020750522614,
          0.13961520791053772,
          -0.028141764923930168,
          0.03395184129476547,
          0.0008990427013486624,
          -0.043929073959589005,
          0.06468961387872696,
          -0.136879563331604,
          0.03337778523564339,
          -0.07661417871713638,
          -0.049344781786203384,
          -0.05296115577220917,
          -0.12484908103942871,
          -0.14816276729106903,
          0.12414256483316422,
          -0.10665252804756165,
          0.06815692037343979,
          0.1379280388355255,
          0.1343573033809662,
          0.12595918774604797,
          -0.13133972883224487,
          0.10793555527925491,
          0.13126274943351746,
          -0.08899372071027756,
          0.10724373161792755,
          0.09712870419025421,
          0.07445377856492996,
          0.038825344294309616,
          -0.03966165706515312,
          -0.11427538841962814,
          -0.09417975693941116,
          0.050377458333969116,
          0.0847795158624649,
          0.002867078874260187,
          0.10015878826379776,
          -0.10281284153461456,
          0.03655233979225159,
          -0.13020770251750946,
          -0.08428061008453369,
          0.08072201907634735,
          -0.0015063142636790872,
          0.13601019978523254,
          0.08324728161096573,
          0.0631701871752739,
          0.030637383460998535,
          -0.06555378437042236,
          0.15099680423736572,
          -0.08612456917762756,
          -0.010607004165649414,
          -0.08908283710479736,
          0.040356338024139404,
          0.07519256323575974,
          -0.09892208129167557,
          -0.0236063152551651,
          0.035240426659584045,
          -0.0638204887509346,
          -0.05091806501150131,
          0.11247304081916809,
          0.013752982020378113,
          -0.14456705749034882,
          0.10209258645772934,
          0.0555444061756134,
          0.029397666454315186,
          0.008420470170676708,
          0.017917590215802193,
          -0.10501373559236526,
          0.08027961105108261,
          -0.06199096888303757,
          -0.058647505939006805,
          0.0851898193359375,
          0.14679738879203796,
          -0.1369946002960205,
          0.0592455193400383,
          0.14258305728435516,
          0.09014008939266205,
          0.06521520763635635,
          0.03918576240539551,
          0.1155172735452652,
          -0.058640822768211365,
          -0.06227332353591919,
          -0.13267098367214203,
          0.04551044851541519,
          0.1266975998878479,
          0.03693214803934097,
          0.1001935675740242,
          0.02688826248049736,
          -0.09464915841817856,
          0.13567259907722473,
          0.10772308707237244,
          0.14492173492908478,
          -0.031615015119314194,
          0.01904061995446682,
          -0.018666334450244904,
          -0.12767177820205688,
          0.1144108772277832,
          -0.059475257992744446,
          -0.031372442841529846,
          0.012729797512292862,
          -0.10544019937515259,
          -0.10145877301692963,
          -0.041916269809007645,
          -0.09505285322666168,
          0.07839567959308624,
          0.1346501260995865,
          0.0556960292160511,
          -0.11539535969495773,
          -0.04486720263957977,
          -0.13161934912204742,
          0.0004074609896633774,
          -0.023389067500829697,
          -0.0750088095664978,
          -0.11398789286613464,
          0.11848203092813492,
          0.015204332768917084,
          -0.053976066410541534,
          -0.13326479494571686,
          0.04339476302266121,
          0.1531396359205246,
          0.14114663004875183,
          -0.12675075232982635,
          0.04206029698252678,
          -0.08660636097192764,
          -0.02197246439754963,
          -0.08796849101781845,
          -0.019267210736870766,
          -0.062278006225824356,
          -0.09745173156261444,
          0.048823434859514236,
          -0.13403086364269257,
          0.09104010462760925,
          0.010959703475236893,
          -0.03446386009454727,
          0.055389586836099625,
          0.1207515299320221,
          0.0898163914680481,
          -0.14588066935539246,
          -0.08837340027093887,
          0.04917600005865097,
          0.03966763615608215,
          0.055589158087968826,
          0.1453787088394165,
          0.007298286072909832,
          0.0978340432047844,
          -0.11149912327528,
          -0.15547730028629303,
          -0.059624083340168,
          0.04923116788268089,
          0.0028580904472619295,
          0.12951764464378357,
          0.062398578971624374,
          0.14088734984397888,
          0.05311327427625656,
          -0.08404510468244553,
          -0.06277234107255936,
          0.025241708382964134,
          0.073143869638443,
          0.09150635451078415,
          -0.11666508764028549,
          -0.028627008199691772,
          0.11829812079668045,
          0.08782034367322922,
          0.14490962028503418,
          -0.017553530633449554,
          0.0009663801756687462,
          -0.03653717786073685,
          0.014620589092373848,
          -0.052211832255125046,
          -0.004716299939900637,
          0.08373875916004181,
          0.038416191935539246,
          0.06025867536664009,
          -0.10086249560117722,
          -0.1452527791261673,
          -0.057481471449136734,
          0.007557209115475416,
          0.11709829419851303,
          0.007856730371713638,
          -0.10936328768730164,
          -0.02845183201134205,
          -0.09811226278543472,
          0.10607465356588364,
          0.10779552906751633,
          -0.10935385525226593,
          0.12387082725763321,
          -0.14690671861171722,
          -0.047252241522073746,
          -0.10307708382606506,
          0.06235765665769577,
          -0.09445387125015259,
          0.04442179203033447,
          -0.11750274151563644,
          0.10024148225784302,
          -0.08312312513589859,
          0.06466888636350632,
          0.1277649849653244,
          -0.04610436409711838,
          0.1399066001176834,
          0.09357699751853943,
          0.08243987709283829,
          -0.023736542090773582,
          -0.03339548036456108,
          -0.0759098157286644,
          -0.02362779527902603,
          0.003922837320715189,
          0.14076924324035645,
          0.01957729086279869,
          -0.027435090392827988,
          0.06829740107059479,
          -0.06859143823385239,
          0.11914415657520294,
          0.0601058155298233,
          0.1301422268152237,
          0.09490399062633514,
          0.07664081454277039,
          -0.07551014423370361,
          0.05746211111545563,
          -0.013280545361340046,
          -0.03446919843554497,
          -0.15439215302467346,
          -0.0018799722893163562,
          0.02618790604174137,
          0.11621704697608948,
          -0.02364189364016056,
          0.09666002541780472,
          0.03978869691491127,
          -0.14286424219608307,
          -0.14629799127578735,
          -0.13808341324329376,
          0.0523533932864666,
          -0.022786857560276985,
          -0.0334298238158226,
          0.020076755434274673,
          -0.06606820225715637,
          0.1573672592639923,
          0.07632037252187729,
          -0.09157764166593552,
          0.11404117941856384,
          0.05378003790974617,
          -0.10224617272615433,
          0.06397830694913864,
          -0.07762685418128967,
          0.11463814228773117,
          -0.1164628192782402,
          -0.10678025335073471,
          -0.05269159376621246,
          0.12073233723640442,
          -0.10124188661575317,
          -0.07333902269601822,
          0.015063063241541386,
          -0.009724054485559464,
          0.07581997662782669,
          -0.04609638825058937,
          0.08430835604667664,
          -0.12294566631317139,
          0.040166500955820084,
          -0.12246069312095642,
          0.12973856925964355,
          0.019162723794579506,
          -0.08747544884681702,
          0.03945629671216011,
          0.0814908966422081,
          -0.02470177412033081,
          0.01147158071398735,
          0.04626785218715668,
          -0.05350113660097122,
          0.053772859275341034,
          0.046133194118738174,
          -0.14993040263652802,
          -0.03436489775776863,
          0.010229055769741535,
          0.07032802700996399,
          0.14798825979232788,
          0.0648903176188469,
          -0.12627029418945312,
          -0.08993374556303024,
          -0.04335590451955795,
          -0.12932471930980682,
          0.1524711698293686,
          -0.037085942924022675,
          -0.1284274458885193,
          -0.08989881724119186,
          0.06691622734069824,
          -0.04879489541053772,
          0.1413440853357315,
          0.10393882542848587,
          -0.0882224589586258,
          0.13859933614730835,
          0.026852484792470932,
          0.03562568500638008,
          -0.14035753905773163,
          -0.07240486145019531,
          -0.010403088293969631,
          0.09424950182437897,
          0.0631927102804184,
          -0.014667642302811146,
          -0.049567509442567825,
          -0.1004904955625534,
          -0.02063838765025139,
          -0.049610987305641174,
          0.1350153237581253,
          0.030556146055459976,
          0.08766449987888336,
          0.03990828990936279,
          0.12550775706768036,
          -0.09604848176240921,
          0.07225536555051804,
          0.09325576573610306,
          -0.11860314011573792,
          -0.08994786441326141,
          0.021601537242531776,
          0.11345631629228592,
          -0.11944516003131866,
          -0.05515800416469574,
          -0.12446232885122299,
          -0.0386735275387764,
          0.05026400089263916,
          -0.12847359478473663,
          0.1469801962375641,
          -0.1233469694852829,
          -0.13945217430591583,
          0.13620105385780334,
          0.15895585715770721,
          -0.058887019753456116,
          -0.1344643235206604,
          -0.09291573613882065,
          -0.1328536421060562,
          -0.09092483669519424,
          0.12115170061588287,
          0.10285262018442154,
          0.10718376934528351,
          -0.11971626430749893,
          0.03806668892502785,
          0.14110149443149567,
          0.015670333057641983,
          0.06959902495145798,
          -0.11558745801448822,
          -0.13895057141780853,
          -0.10562284290790558,
          -0.11434489488601685,
          -0.06817814707756042,
          0.022672139108181,
          -0.10119468718767166,
          0.09179951250553131,
          -0.10363791137933731,
          -0.08739133179187775,
          -0.07090888917446136,
          -0.1523667275905609,
          -0.09075400978326797,
          -0.10565358400344849,
          -0.1137368455529213,
          -0.08276586979627609,
          0.1303667277097702,
          -0.07757357507944107,
          0.009023330174386501,
          -0.05188824236392975,
          0.041109248995780945,
          0.14680729806423187,
          -0.08268226683139801,
          1.830085057008546e-05,
          -0.15019886195659637,
          0.0005475484067574143,
          0.08058023452758789,
          0.07506467401981354,
          -0.017241399735212326,
          0.030408024787902832,
          -0.05675625801086426,
          -0.07096223533153534,
          0.14169660210609436,
          -0.06527341902256012,
          0.029110748320817947,
          -0.05431303381919861,
          -0.08672592788934708,
          -0.08358532935380936,
          0.08944492042064667,
          0.07452458888292313,
          0.03413102775812149,
          -0.060891445726156235,
          0.10698842257261276,
          0.143173485994339,
          0.12121766060590744,
          -0.005060811992734671,
          0.017666293308138847,
          0.015019094571471214,
          0.0025788485072553158,
          0.08392325043678284,
          -0.11887495219707489,
          -0.004878138191998005,
          -0.1412242352962494,
          -0.1441081464290619,
          0.10066062211990356,
          0.09122391045093536,
          0.10307332128286362,
          -0.055965855717659,
          0.14261391758918762,
          -0.07967019081115723,
          0.10545103251934052,
          -0.022481393069028854,
          0.10775713622570038,
          -0.11635078489780426,
          0.15017171204090118,
          -0.10366588830947876,
          0.06990697234869003,
          -0.12062922865152359,
          -0.05625446140766144,
          -0.04703760892152786,
          0.1453239917755127,
          0.04871588572859764,
          -0.020024292171001434,
          -0.001997017301619053,
          -0.03631329536437988,
          0.09940638393163681,
          -0.09172657877206802,
          0.08064690232276917,
          0.015836909413337708,
          -0.09052956849336624,
          -0.03870343789458275,
          -0.09429782629013062,
          -0.042582470923662186,
          -0.05963897332549095,
          -0.13974733650684357,
          0.06263335049152374,
          -0.04933959245681763,
          0.022406306117773056,
          0.012362252920866013,
          -0.042250022292137146,
          0.045709241181612015,
          0.13033555448055267,
          0.0738840326666832,
          -0.14348874986171722,
          -0.13784819841384888,
          -0.13796037435531616,
          0.022961175069212914,
          -0.15454386174678802,
          0.12201493233442307,
          -0.0457608737051487,
          0.08323593437671661,
          0.1261259913444519,
          -0.008275437168776989,
          0.15253165364265442,
          0.0663345456123352,
          -0.11188698559999466,
          -0.12437941133975983,
          0.033286213874816895,
          0.11371555179357529,
          0.08717632293701172,
          -0.11100700497627258,
          0.08505800366401672,
          0.08121418207883835,
          -0.07154404371976852,
          -0.1030953899025917,
          -0.0729912668466568,
          -0.024589750915765762,
          0.07112138718366623,
          0.12150119245052338,
          -0.06450796872377396,
          0.09575109928846359,
          -0.13379357755184174,
          0.08901697397232056,
          -0.011320932768285275,
          -0.0031453934498131275,
          -0.06795143336057663,
          0.011633950285613537,
          0.012643951922655106,
          -0.0423409640789032,
          -0.06442460417747498,
          0.09626683592796326,
          0.09697897732257843,
          0.1041603535413742,
          -0.09535029530525208,
          -0.0299192164093256,
          0.02830994687974453,
          -0.07228466123342514,
          0.045428287237882614,
          0.09383077919483185,
          -0.15002715587615967,
          0.03356803208589554,
          0.14240267872810364,
          0.11804187297821045,
          -0.051526233553886414,
          -0.11515957862138748,
          -0.06839247792959213,
          -0.08395802974700928,
          0.06946016848087311,
          0.1066841334104538,
          -0.0809389054775238,
          -0.1184031292796135,
          -0.02477949857711792,
          -0.03657352924346924,
          -0.14774252474308014,
          -0.045819010585546494,
          -0.027839388698339462,
          -0.13896134495735168,
          0.09196397662162781,
          0.053239647299051285,
          -0.049849096685647964,
          0.10878013074398041,
          -0.15371781587600708,
          -0.048876579850912094,
          0.07096584886312485,
          -0.021751077845692635,
          -0.09994706511497498,
          0.028806354850530624,
          0.02881494350731373,
          -0.06799966096878052,
          -0.1505718231201172,
          0.0058418684639036655,
          0.05522898584604263,
          -0.0619867779314518,
          -0.09948202967643738,
          0.004494758788496256,
          0.0431353785097599,
          0.0371038094162941,
          -0.11447080224752426,
          0.04210595786571503,
          0.10527673363685608,
          0.05767269805073738,
          0.034164611250162125,
          -0.07277440279722214,
          0.034331273287534714,
          -0.0271467212587595,
          -0.11693423986434937,
          0.012515908107161522,
          0.002484876662492752,
          -0.10141237080097198,
          0.05601838603615761,
          0.007411587052047253,
          -0.15132132172584534,
          0.13348928093910217,
          -0.03647425398230553,
          0.04164794459939003,
          -0.08561350405216217,
          -0.1028365045785904,
          0.09113059192895889,
          -0.025055566802620888,
          0.03989694267511368,
          0.07950052618980408,
          0.0337078683078289,
          0.06063958257436752,
          0.13635890185832977,
          -0.044870346784591675,
          -0.10926581919193268,
          0.10455162078142166,
          -0.05790647119283676,
          -0.06554758548736572,
          0.0023208525963127613,
          -0.01725095324218273,
          0.10468671470880508,
          -0.15527121722698212,
          -0.040386348962783813,
          -0.06162649393081665,
          -0.1024998128414154,
          -0.07994777709245682,
          -0.08376739919185638,
          -0.02696380764245987,
          -0.0005505551234818995,
          0.043457843363285065,
          0.006616760976612568,
          -0.06818964332342148,
          0.021007267758250237,
          -0.04726972058415413,
          -0.0075096082873642445,
          -0.08425501734018326,
          0.02825450524687767,
          0.08711094409227371,
          0.038457613438367844,
          0.010382798500359058,
          -0.07810858637094498,
          -0.038399308919906616,
          -0.07359499484300613,
          -0.03236747905611992,
          -0.13705143332481384,
          -0.06378285586833954,
          -0.03974431753158569,
          0.153313547372818,
          -0.025334510952234268,
          0.11406706273555756,
          -0.13936235010623932,
          0.07516321539878845,
          -0.03791337460279465,
          0.01921832375228405,
          -0.14560870826244354,
          -0.07330972701311111,
          0.14372770488262177,
          -0.04153547063469887,
          -0.1180601716041565,
          -0.05523337051272392,
          -0.11352963745594025,
          -0.003786685410887003,
          -0.11675895005464554,
          -0.0333062969148159,
          0.13245892524719238,
          0.021930579096078873,
          -0.07546763122081757,
          -0.05812028422951698,
          -0.11166955530643463,
          0.011962085962295532,
          0.08011908084154129,
          -0.09030488133430481,
          0.013155088759958744,
          0.0732521340250969,
          -0.07042079418897629,
          0.09165996313095093,
          0.11218781024217606,
          0.03981807827949524,
          -0.1451900154352188,
          0.13862434029579163,
          0.13922268152236938,
          0.019752494990825653,
          -0.13912449777126312,
          0.07110181450843811,
          -0.0026400750502943993,
          0.09823214262723923,
          -0.1179845929145813,
          -0.06431825459003448,
          -0.04923605918884277,
          0.006489024497568607,
          0.051618654280900955,
          0.13599620759487152,
          -0.05957409366965294,
          0.11274852603673935,
          -0.003951167222112417,
          -0.04815172404050827,
          0.050742991268634796,
          -0.0188609566539526,
          0.03539440780878067,
          -0.07572346180677414,
          -0.009299411438405514,
          0.15848477184772491,
          -0.05975275859236717,
          0.0776260569691658,
          0.13595448434352875,
          -0.041566308587789536,
          0.010674824006855488,
          0.14441896975040436,
          0.08480952680110931,
          -0.14170610904693604,
          0.06187494471669197,
          -0.0554223470389843,
          0.11078867316246033,
          0.057489339262247086,
          0.038324225693941116,
          0.07707599550485611,
          0.1562456637620926,
          -0.016358444467186928,
          0.0994272232055664,
          -0.0523591972887516,
          0.00841834582388401,
          0.06530365347862244,
          -0.13335999846458435,
          0.10228119790554047,
          0.03932958468794823,
          -0.14047923684120178,
          -0.12849298119544983,
          0.04517095163464546,
          -0.010485985316336155,
          0.139699786901474,
          -0.03558143600821495,
          0.05746051296591759,
          0.12990088760852814,
          0.06549032777547836,
          -0.09297944605350494,
          0.07315123081207275,
          -0.0881936103105545,
          0.04918571934103966,
          -0.07746034860610962,
          0.0044797370210289955,
          -0.07610338926315308,
          -0.13923379778862,
          -0.16340219974517822,
          -0.006646015681326389,
          -0.15920217335224152,
          0.08618342131376266,
          0.06798835843801498,
          -0.03276805952191353,
          -0.1474931538105011,
          -0.05883166939020157,
          -0.12424460053443909,
          -0.05117154121398926,
          0.03482045978307724,
          0.10802454501390457,
          -0.09249304234981537,
          0.06896656006574631,
          0.13577724993228912,
          0.06134296953678131,
          0.00930903572589159,
          0.1528046876192093,
          0.07687187194824219,
          0.06376590579748154,
          0.05135076120495796,
          0.011550757102668285,
          0.10028155893087387,
          0.08229491114616394,
          0.038628242909908295,
          0.003773035015910864,
          0.0691731721162796,
          0.09141094982624054,
          -0.04228564351797104,
          0.0874405950307846,
          -0.09934309870004654,
          -0.12472423911094666,
          -0.10310401022434235,
          0.1455492079257965,
          0.13509336113929749,
          0.02741238661110401,
          0.14887452125549316,
          0.149131640791893,
          0.06929421424865723,
          -0.0641266256570816,
          -0.060567706823349,
          0.014253826811909676,
          -0.004389951005578041,
          0.08176624774932861,
          -0.08110228180885315,
          0.1289437860250473,
          -0.06788397580385208,
          0.02134142816066742,
          0.08144831657409668,
          -0.03809594735503197,
          0.04020678624510765,
          -0.05044618993997574,
          0.02328551560640335,
          -0.025829646736383438,
          0.06706787645816803,
          0.04239420220255852,
          0.10622064769268036,
          -0.10442567616701126,
          0.04092938452959061,
          -0.07251708209514618,
          -0.04968910291790962,
          -0.029663577675819397,
          0.09037462621927261,
          -0.04775324836373329,
          0.09957011789083481,
          0.1316632181406021,
          0.041406065225601196,
          0.09850011020898819,
          0.06682262569665909,
          -0.004602112807333469,
          -0.048803675919771194,
          0.14950180053710938,
          0.0010204886784777045,
          0.056488893926143646,
          -0.04629405960440636,
          0.02360774390399456,
          -0.058050744235515594,
          -0.08311594277620316,
          0.0159654151648283,
          -0.06447182595729828,
          0.14256025850772858,
          -0.10161848366260529,
          -0.039530325680971146,
          -0.15926948189735413,
          -0.010536512359976768,
          -0.08334264159202576,
          0.047518182545900345,
          0.12675857543945312,
          -0.002400763100013137,
          0.018694180995225906,
          0.007504436187446117,
          -0.03168132156133652,
          0.10402330011129379,
          0.08581538498401642,
          -0.09110532701015472,
          -0.12490227818489075,
          -0.13733221590518951,
          -0.07690180838108063,
          0.03493091091513634,
          0.03509170934557915,
          -0.15374882519245148,
          0.09122548997402191,
          -0.14564886689186096,
          -0.1104520633816719,
          0.04655454307794571,
          0.013032988645136356,
          0.13017834722995758,
          0.09864602237939835,
          0.015133519656956196,
          0.018637606874108315,
          -0.13411259651184082,
          -0.11421440541744232,
          0.012674294412136078,
          0.05453735589981079,
          0.13573861122131348,
          -0.1034923866391182,
          0.098709337413311,
          -0.09316582977771759,
          -0.01391326542943716,
          0.10661876201629639,
          -0.1280936598777771,
          0.1227307915687561,
          -0.00911692250519991,
          -0.05758814141154289,
          -0.1357560157775879,
          0.08892524242401123,
          -0.06170323118567467,
          -0.06985289603471756,
          0.10523849725723267,
          0.12217620760202408,
          0.11417432874441147,
          -0.015212385915219784,
          -0.14620152115821838,
          -0.09554094821214676,
          -0.11850979924201965,
          0.09437761455774307,
          -0.04097254201769829,
          0.11413875222206116,
          0.07400452345609665,
          0.038569942116737366,
          0.11029262840747833,
          -0.11899532377719879,
          0.08037395775318146,
          -0.05212734267115593,
          -0.12242799252271652,
          0.06906036287546158,
          0.0010411101393401623,
          -0.12765634059906006,
          -0.021875903010368347,
          -0.1331692934036255,
          -0.04791506007313728,
          -0.013147733174264431,
          0.11400274187326431,
          0.13956288993358612,
          -0.09510066360235214,
          -0.15672709047794342,
          0.10115716606378555,
          0.08169349282979965,
          -0.11217909306287766,
          0.04047922417521477,
          -0.07460594922304153,
          0.05499473959207535,
          -0.015342118218541145,
          0.03550252690911293,
          -0.10961099714040756,
          0.01432151161134243,
          -0.05716633051633835,
          0.06773549318313599,
          -0.013666972517967224,
          -0.0884057804942131,
          0.14234822988510132,
          0.10967135429382324,
          0.013845897279679775,
          -0.039870042353868484,
          0.13028839230537415,
          -0.06041092053055763,
          0.019687162712216377,
          -0.06225867196917534,
          0.05967957153916359,
          0.10129804909229279,
          -0.08211879432201385,
          -0.012625220231711864,
          0.008831283077597618,
          0.059865519404411316,
          -0.007137324661016464,
          0.0035363156348466873,
          -0.010129871778190136,
          0.11925026774406433,
          0.05358657240867615,
          -0.00856950506567955,
          -0.1298602968454361,
          0.08624335378408432,
          0.016197621822357178,
          -0.09402173012495041,
          0.03561203554272652,
          -0.0779818594455719,
          0.06288790702819824,
          0.12377192080020905,
          -0.04920204356312752,
          0.01875259354710579,
          -0.007316551171243191,
          0.0016653264174237847,
          0.14169397950172424,
          -0.057502854615449905,
          -0.011539813131093979,
          -0.07794835418462753,
          -0.002394204493612051,
          -0.06340763717889786,
          -0.003791998140513897,
          0.010182058438658714,
          -0.02782074734568596,
          -0.11152541637420654,
          -0.15644846856594086,
          0.013712781481444836,
          -0.08124382793903351,
          -0.014177010394632816,
          0.10880466550588608,
          0.061425790190696716,
          -0.10135310888290405,
          -0.06231135129928589,
          0.014765248633921146,
          -0.1178736761212349,
          0.09113440662622452,
          -0.028891948983073235,
          -0.06859690696001053,
          0.014517273753881454,
          0.1352604478597641,
          -0.07207227498292923,
          0.026985999196767807,
          -0.12710781395435333,
          0.13540643453598022,
          0.011034231632947922,
          -0.1187216192483902,
          -0.03206748887896538,
          -0.02896925061941147,
          -0.054697632789611816,
          -0.09876538813114166,
          0.1084914430975914,
          -0.059150222688913345,
          0.00026933211483992636,
          0.06429076194763184,
          -0.011139463633298874,
          -0.13318918645381927,
          -0.004110170993953943,
          -0.014711550436913967,
          0.09923193603754044,
          0.0031678180675953627,
          0.05774480104446411,
          -0.004916482139378786,
          -0.032355450093746185,
          0.14042407274246216,
          0.07697980850934982,
          0.03463366627693176,
          0.12755849957466125,
          0.1440849006175995,
          -0.11821859329938889,
          0.10486304014921188,
          -0.14764636754989624,
          0.06384959071874619,
          0.1265168935060501,
          0.03498496860265732,
          0.04028060659766197,
          -0.14789804816246033,
          -0.04658893123269081,
          -0.08052071183919907,
          0.06373326480388641,
          0.09538279473781586,
          0.1450289487838745,
          0.011799478903412819,
          -0.05895445495843887,
          0.13046832382678986,
          0.14398236572742462,
          0.04469013214111328,
          0.014611372724175453,
          0.09128335118293762,
          0.08548548072576523,
          0.0777273178100586,
          0.022567035630345345,
          -0.149770587682724,
          0.11173034459352493,
          -0.01638658158481121,
          -0.0756760910153389,
          0.089056596159935,
          0.10656847804784775,
          0.025232624262571335,
          0.09757483005523682,
          0.10860814154148102,
          0.11197362095117569,
          -0.08003860712051392,
          0.040274929255247116,
          -0.10456106811761856,
          0.15089988708496094,
          -0.02438352070748806,
          0.054630838334560394,
          -0.13915307819843292,
          -0.0464012585580349,
          -0.015094696544110775,
          0.005330550018697977,
          -0.06162017583847046,
          0.08999601751565933,
          0.15024620294570923,
          0.014547610655426979,
          0.049519132822752,
          -0.12188411504030228,
          -0.04694829881191254,
          0.02343960851430893,
          -0.0645112693309784,
          0.06461073458194733,
          0.13552890717983246,
          0.01849459670484066,
          -0.06062856316566467,
          0.1457524299621582,
          0.05972644314169884,
          0.1078479140996933,
          -0.12662535905838013,
          0.1279514580965042,
          -0.11605477333068848,
          0.04932590574026108,
          0.005804837215691805,
          0.13980598747730255,
          -0.03218361362814903,
          -0.1571492850780487,
          -0.06400824338197708,
          -0.034961946308612823,
          -0.03157443553209305,
          0.10077863186597824,
          -0.030132966116070747,
          0.005611945874989033,
          0.020197875797748566,
          0.08887117356061935,
          0.1416875123977661,
          -0.03619915619492531,
          -0.0119805121794343,
          0.04867001250386238,
          -0.08204488456249237,
