{
  "architectures": [
    "LSTMStockPredictor"
  ],
  "model_type": "custom_lstm",
  "task_type": "stock-prediction",
  "framework": "custom",
  "hidden_size": 50,
  "input_size": 50,
  "sequence_length": 10,
  "num_features": 5,
  "output_size": 1,
  "features": ["Open", "High", "Low", "Close", "Volume"],
  "preprocessing": {
    "scaler": "MinMaxScaler",
    "feature_range": [0, 1]
  },
  "version": "2.0",
  "torch_dtype": "float32",
  "transformers_version": "compatible"
}