{
  "framework": "custom",
  "task": "time-series-forecasting",
  "model_type": "simple_nhits",
  "architectures": ["NHITSModelScopePredictor"],
  "model_config": {
    "model_type": "Simple-NHITS",
    "version": "2.0",
    "input_size": 30,
    "n_stacks": 3,
    "pooling_sizes": [2, 4, 8],
    "hierarchical_levels": 3,
    "interpolation_weights": [0.5, 0.3, 0.2]
  },
  "performance_metrics": {
    "direction_accuracy": 58.3,
    "validation_confidence": 0.95,
    "inference_time_ms": 0.3,
    "model_complexity": "Low - CPU only",
    "improvement_over_baseline": "8.3% better direction accuracy than LSTM"
  },
  "input_format": {
    "type": "OHLCV_sequence",
    "description": "List of [Open, High, Low, Close, Volume] arrays",
    "min_sequence_length": 5,
    "recommended_sequence_length": 30,
    "example": [
      [220.0, 225.0, 218.5, 223.0, 45000000],
      [223.5, 227.0, 221.0, 225.8, 42000000]
    ]
  },
  "output_format": {
    "predicted_price": "Next day closing price prediction",
    "confidence": "Model confidence score (0.5-0.95)",
    "current_price": "Last known closing price",
    "price_change": "Absolute price change prediction",
    "price_change_pct": "Percentage change prediction",
    "direction": "UP/DOWN/FLAT trend indication"
  },
  "deployment_info": {
    "created": "2025-09-02",
    "replaced": "LSTM baseline model",
    "deployment_type": "ModelScope public model",
    "inference_mode": "CPU-only",
    "model_file": "nhits_modelscope_inference.py",
    "license": "Apache-2.0"
  },
  "usage_example": {
    "python": {
      "import": "from nhits_modelscope_inference import NHITSModelScopePredictor",
      "initialize": "model = NHITSModelScopePredictor()",
      "predict": "result = model.predict_price(ohlcv_sequence)",
      "output": "print(f\"Predicted: ${result['predicted_price']:.2f}\")"
    },
    "api_call": {
      "endpoint": "https://modelscope.cn/api/v1/models/yanggf2/simple-nhits-stock-predictor/predict",
      "method": "POST",
      "body": {
        "sequence_data": "[[Open,High,Low,Close,Volume], ...]"
      }
    }
  }
}